In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target= df.Survived
inputs = df.drop(['Survived'],axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [8]:
inputs.isna().any()

Pclass    False
Age        True
Fare      False
female    False
dtype: bool

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [12]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [13]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target, test_size=0.2)

In [14]:
len(X_train)

712

In [15]:
len(X_test)

179

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_test,y_test)

0.7486033519553073

In [19]:
X_test[:10]

     Pclass        Age      Fare  female
404       3  20.000000    8.6625       1
739       3  29.699118    7.8958       0
345       2  24.000000   13.0000       1
487       1  58.000000   29.7000       0
511       3  29.699118    8.0500       0
4         3  35.000000    8.0500       0
319       1  40.000000  134.5000       1
343       2  25.000000   13.0000       0
522       3  29.699118    7.2250       0
744       3  31.000000    7.9250       0

In [20]:
y_test[:10]

404    0
739    0
345    1
487    0
511    0
4      0
319    1
343    0
522    0
744    1
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [22]:
model.predict_proba(X_test[:10])

array([[3.87839608e-01, 6.12160392e-01],
       [9.71253755e-01, 2.87462451e-02],
       [2.48667098e-01, 7.51332902e-01],
       [7.76109479e-01, 2.23890521e-01],
       [9.71279731e-01, 2.87202687e-02],
       [9.72146447e-01, 2.78535527e-02],
       [4.79911081e-04, 9.99520089e-01],
       [9.38862291e-01, 6.11377094e-02],
       [9.71134482e-01, 2.88655179e-02],
       [9.71575896e-01, 2.84241045e-02]])